{"1.What is a Native App?.md":[{"title":"What is a Hybrid App?","content":"\nHybrid app is a combination of both native and web apps. Where need to embed the code written in JavaScript into the native app, and the web app is used to display the content.\n","section":"1.What is a Native App?.md","source":"https://www.netsolutions.com/insights/native-vs-hybrid-vs-cross-platform/#what-is-a-native-app"}],"10. How React Native is different from React?.md":[{"title":"How React Native is different from React?","content":"\nReact is an open-source JS library for building the UIs for web applications; besides, React Native is used to building rich mobile UI from declarative components using only JavaScript.\n","section":"10. How React Native is different from React?.md","source":"https://stackoverflow.com"}],"11. What are the advantages of using React Native.md":[{"title":"What are the advantages of using React Native","content":"\n- Large community\n- Reuseable components\n- Live reload\n- Additional libraries\n","section":"11. What are the advantages of using React Native.md","source":"https://stackoverflow.com"}],"12. What is native module in react native.md":[{"title":"What is native module in react native ?","content":"\nNative Module is a way to communicate between React Native and native code. It is a bridge between React Native and Platform native code. Native modules are used to access platform capabilities, such as accessing the phone camera, accessing the phone storage, accessing the user’s location, etc.\n","section":"12. What is native module in react native.md","source":"https://stackoverflow.com"}],"13. What is difference between React Native and Expo?.md":[{"title":"What is the difference between React Native and Expo?","content":"","section":"13. What is difference between React Native and Expo?.md","source":"https://stackoverflow.com"}],"14. What is Expo CLI in React Native?.md":[{"title":"What is Expo CLI in React Native?","content":"\nExpo CLI is a command line interface for developing Expo apps. It is a tool for creating, building, and publishing react-native apps. It provides a development server that allows us to easily run our app on our device. It also provides a way to publish our app to the Expo app store.\n","section":"14. What is Expo CLI in React Native?.md","source":"https://stackoverflow.com"}],"15. What SDK means?.md":[{"title":"What SDK means?","content":"\nSDK stands for Software Development Kit. It is a set of tools and libraries that allow you to build applications for a specific platform. For example, Android SDK allows you to build Android apps, iOS SDK allows you to build iOS apps.\n","section":"15. What SDK means?.md","source":"https://stackoverflow.com"}],"16. What is native components in react native.md":[{"title":"What are native components in react native?","content":"\nAt runtime, React Native creates the corresponding Android and iOS views for those components. Because React Native components are backed by the same views as Android and iOS, React Native apps look, feel, and perform like any other apps. We call these platform-backed components Native Components.\n","section":"16. What is native components in react native.md","source":"https://reactnative.dev"}],"17. What are most useful core components in react native.md":[{"title":"What are most useful core components in react native","content":"\nThe core components are the building blocks of a React Native app. Here is a list of some of the most commonly used core components:\n\n- [View](https://reactnative.dev/docs/view)\n- [Text](https://reactnative.dev/docs/text)\n- [Image](https://reactnative.dev/docs/image)\n- [ScrollView](https://reactnative.dev/docs/scrollview)\n- [TextInput](https://reactnative.dev/docs/textinput)\n- [StyleSheet](https://reactnative.dev/docs/stylesheet)\n- [TouchableOpacity](https://reactnative.dev/docs/touchableopacity)\n- [TouchableHighlight](https://reactnative.dev/docs/touchablehighlight)\n- [FlatList](https://reactnative.dev/docs/flatlist)\n- [SectionList](https://reactnative.dev/docs/sectionlist)\n","section":"17. What are most useful core components in react native.md","source":"https://reactnative.dev"}],"18. How to write platform specific code in react native.md":[{"title":"How to write platform-specific code in react native","content":"\nIn React-Native there are two ways to write platform-specific code:\n\n- Using Platform module\n- Using Platform-specific extensions\n\n**Using Platform module**\n\nFor Android\n\n```js\nimport { Platform } from 'react-native'\n\nif (Platform.OS === 'android') {\n\t// do something\n}\n```\n\nFor iOS\n\n```js\nimport { Platform } from 'react-native'\n\nif (Platform.OS === 'ios') {\n\t// do something\n}\n```\n\n**Using Platform-specific extensions**\n\nFor Android\n\n```js\nbutton.android.js\nbutton.ios.js\n```\n\n```js\nimport button from './button'\n```\n","section":"18. How to write platform specific code in react native.md","source":"https://reactnative.dev"}],"19. How can you check the device OS version in React Native?.md":[{"title":"How can you check the device OS version in React Native?","content":"\nFor Android\n\n```js\nimport { Platform } from 'react-native'\n\nif (Platform.Version === 28) {\n\t// do something\n}\n```\n\nFor iOS\n\n```js\nimport { Platform } from 'react-native'\nif (Platform.Version === '14.0') {\n\t// do something\n}\n```\n","section":"19. How can you check the device OS version in React Native?.md","source":"https://reactnative.dev"}],"2.What is a Hybrid App?.md":[{"title":"What is a Hybrid App?","content":"\nHybrid apps are essentially web apps that have been put in a native app shell. Once they are downloaded from an app store and installed locally, the shell is able to connect to whatever capabilities the mobile platform provides through a browser that's embedded in the app.\n","section":"2.What is a Hybrid App?.md"}],"20. What is Gradle and why it is used?.md":[{"title":"What is Gradle and why it is used?","content":"\nGradle is a build automation tool that is used to build and manage any Java-based project. It is used to build Android applications. It is open-source.\n\nIn Android, Gradle is used to build the project and manage the dependencies. It is used to compile the code, run unit tests, and generate the final APK file. It is also used to manage the dependencies of the project.\n","section":"20. What is Gradle and why it is used?.md","source":"https://www.geeksforgeeks.org"}],"21. What is the AndroidManifest xml?.md":[{"title":"What is the AndroidManifest XML?","content":"\nAndroidManifest.xml is an XML file that contains information about the application. It is used to declare the components of the application, permissions, and other information about the application.\n","section":"21. What is the AndroidManifest xml?.md","source":"https://reactnative.dev"}],"22. What is Fast Refresh.md":[{"title":"What is Fast Refresh","content":"\nFast Refresh is a new feature in React Native that allows us to get direct feedback for changes in our React components. It is enabled by default in the React Native CLI.\n\nIt works for example if we change the text in the App.js file from \"Hello World\" to \"Hello World!\". it will update this component without reloading the entire application. An alterant if we have a util file and we change the file those changes will be re-render in the other files that are using that util file.\n","section":"22. What is Fast Refresh.md","source":"https://reactnative.dev"}],"23. what is library linking in react native.md":[{"title":"What is library linking in react native","content":"\nWhen a library has native module implementations. Then we have to link the library to the platform-specific native code. This is called library linking.  Linking can be done automatically or manually.\n","section":"23. what is library linking in react native.md","source":"https://reactnative.dev"}],"24. Why Test.md":[{"title":"Why Test","content":"\nTesting is an important part of software development. It is a way to ensure that the code is working as expected. It is also a way to ensure that the code is not broken when new features are added or when existing features are modified.\n","section":"24. Why Test.md","source":"https://reactnative.dev"}],"25. What is Hermes in react native?.md":[{"title":"What is Hermes in react native","content":"\nHermes is a JavaScript engine optimized for running React Native apps on Android. It improves app performance and decreases app size. Hermes is enabled by default in the latest version of React Native.","section":"25. What is Hermes in react native?.md","source":"https://reactnative.dev"}],"3.What is cross-platform mobile app development?.md":[{"title":"What is cross-platform mobile app development?","content":"\nCross platform framework operate to develop shareable and reusable code across multiple platforms. \"Write once, run everywhere\" is the motto of cross platform framework.\nWriting once and reuse the same on multiple platforms helps in minimizing the development time and cost and also ensure hassle-free implementation.\n**Note:** Cross-platform applications are popular in today’s times, all credits to React Native, Xamarin, and Flutter frameworks.\n","section":"3.What is cross-platform mobile app development?.md","source":"https://www.netsolutions.com/insights/native-vs-hybrid-vs-cross-platform/#what-is-a-hybrid-app"}],"4.When to Consider Building a Cross-platform App?.md":[{"title":"When to Consider Building a Cross-platform App?","content":"\n- We have to release a mobile app for both Android and iOS in limited time ,resources and budget.\n- Need to target both Android and iOS platforms.\n- Need faster development.\n- The app isn’t complex and doesn’t need functionalities which vary much between the platforms.\n","section":"4.When to Consider Building a Cross-platform App?.md","source":"https://www.netsolutions.com"}],"5.What is React Native and why it is used?.md":[{"title":"What is React Native and why it is used?","content":"\nReact Native is an open-source JavaScript framework, designed for building apps on multiple platforms like iOS, Android, and also web applications, utilizing the very same code base. It is based on React, and it brings all its glory to mobile app development.\n","section":"5.What is React Native and why it is used?.md","source":"https://reactjs.org/"}],"6.How react native works internally.md":[{"title":"How react native works internally","content":"\nReact Native allows developers to build apps by spinning up JS threads that interpret JavaScript code, by making a native bridge between the app and the target platform. The bridge concept leverages the library and transfers the component’s hierarchy to the mobile devices view.\n\nFor instance, if the user presses a button, this case is translated into an event that JavaScript can handle. After that, by relaying messages between native platforms and JS code, the React Native bridges translates native events into something that React components can understand and work with.\n","section":"6.How react native works internally.md","source":"https://www.reactnative.guide/"}],"7.React Native Threading Model.md":[{"title":"What is React Native Threading Model ?","content":"\nThere are 3 main threads in React Native:\n\n1. Main thread\n2. JS Thread\n3. Native Modules Thread\n\n**Main thread**\nThe Main thread listens to the UI events like 'press', 'touch', etc. These events are then passed to the JS thread via the RN Bridge. Once the Javascript loads, the JS thread sends the information on what needs to be rendered onto the screen.\n\n**JS Thread**\nThe Javascript Queue is the thread queue where the main bundled JS thread runs. The JS thread runs all the business logic, i.e., the code we write in React Native.\n\n**Native Modules Thread**\nIf an app needs access to platform API, this is where the magic happens.\n","section":"7.React Native Threading Model.md","source":"https://digitalya.co/"}],"8. What does React Native use to allow JavaScript to be executed on iOS and Android natively?.md":[{"title":"What does React Native use to allow JavaScript to be executed on iOS and Android natively?","content":"\nOn iOS simulators and devices, Android emulators and devices React Native uses JavaScriptCore which is the JavaScript engine that powers Safari. Our bundle contains the JS code. And it runs on the JavaScriptCore engine. And communicates with the native code through a bridge.\n","section":"8. What does React Native use to allow JavaScript to be executed on iOS and Android natively?.md","source":"https://stackoverflow.com"}],"9. Does React Native use a WebView?.md":[{"title":"Does React Native use a WebView?","content":"\nReact Native uses a JavaScript runtime, but the UI is not HTML and it doesn't use a WebView. We use JSX and React Native-specific components to define the UI. It provides a native-level performance and looks and feels but some UI parts have to be configured separately for iOS and Android.\n","section":"9. Does React Native use a WebView?.md","source":"https://stackoverflow.com"}]}